Repository: staniek/work
Catalog: l10n-*/calligra/messages/kexi.appdata.po
Languages: pl

source: Database Creator
pl: Tworzenie baz danych

source: Kexi is a visual database creator, part of the Calligra Suite. It can be used for designing database applications, inserting and editing data, performing queries, and processing data. Forms can be created to provide a custom interface to your data. All database objects - tables, queries, forms, reports - are stored in the database, making it easy to share data and design.
pl: Kexi, część pakietu Calligra, to aplikacja do wizualnego tworzenia bazdanych. Można jej używać do opracowywania programów bazodanowych,wstawiania, edycji i przetwarzania danych, a także do wykonywania zapytań.Dostęp do danych można zapewniać przy pomocy formularzy. Wszystkie obiektybazy danych, tabele, zapytania, formularze i raporty, są przechowywane wbazie danych, co czyni je łatwymi do współdzielenia i opracowywania.

source: Features:
pl: Możliwości:

source: Full visual designers for tables, queries, forms and reports
pl: W pełni wizualna możliwość tworzenia tabel, zapytań, formularzy i sprawozdań

source: Running queries, support for parametrized queries
pl: Wykonywanie zapytań, obsługa dla zapytań parametrycznych

source: Supports SQLite, MySQL, PostgreSQL and MS SQL Server databases
pl: Obsługa SQLite, MySQL, PostgreSQL oraz baz danych MS SQL Server

source: The only multiplatform graphical tool importing data from MS Access databases
pl: Jedyne graficzne narzędzie wieloplatformowe importujące dane z baz danych MS Access

source: Supports query design in dedicated SQL view
pl: Obsługuje zapytania w widoku przeznaczonym dla SQL

source: Designing and displaying relational data using combo boxes (lookup columns)
pl: Opracowywanie i wyświetlanie danych relacyjnych przy użyciu pól rozwijanych (kolumn wyszukiwania)

source: Direct data entry or import using CSV format
pl: Bezpośrednie wprowadzanie danych lub importowanie ich z postaci CSV

source: Locked down User Mode, allowing you to switch off all commands related to editing your project's design
pl: Zamknięty tryb użytkownika, umożliwiający wyłączenie wszystkich poleceń związanych z edytowaniem twojego projektu

source: Scripting using JavaScript, Python or Ruby programming languages (experimental)
pl: Skrypty wykorzystujące języki programowania JavaScript, Python lub Ruby (eksperymentalnie)

source: Table View storing images
pl: Przechowywanie obrazów w widoku tabeli

source: Form Designer
pl: Opracowywanie formularzy
